results/axum_light_20251009_070958/wrk_output.txt
Running 30s test @ http://127.0.0.1:8081/hello
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.62ms  148.88ms   1.35s    96.69%
    Req/Sec    23.53k     2.91k   29.04k    81.52%
  Latency Distribution
     50%    0.92ms
     75%    1.43ms
     90%    2.34ms
     99%  989.81ms
  2820067 requests in 31.37s, 618.56MB read
Requests/sec:  89903.32
Transfer/sec:     19.72MB